<script>
    import { translateText } from 'lang'
    import { isPopupInfoOpened} from '../../stores.js'

</script>

<div class="lvlpbbuy">
    <div class="bpinform">
        <h1>Информация об Боевом пропуске <span on:keypress={() => {}} on:click={() => isPopupInfoOpened.set(false)}>X</span></h1>
        <p><b>Боевой пропуск</b> - это уровневая система вознаграждений за выполнение заданий в течение определенного времени(”сезона”). Повышается уровень засчет XP.</p>
        <p><b>XP</b> - это опыт, который вы получаете за каждое задание. Чем больше XP, тем выше уровень, а с каждым новым уровнем можно забрать новые крутые награды!</p>
        <p>Существует два видна пропуска - <b>Стандартный</b> и <b>Премиум</b>. Премиум опция приобретается за RedBucks и позволяет получать дополнительные награды за выполнение уровней, обычная - абсолютно бесплатная для каждого.</p>
        <p><b>Сеть заданий</b> - это дополнительная ветка заданий, за выполнение которых вы так же сможете получить дополнительный XP и награды. Обратите внимание, что выполнение засчитывается, если вы выбрали задание, перед тем как выполнить его.</p>
    </div>
</div>